podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV40F16.h
/**
* @addtogroup ADC_Register_Masks_GROUP ADC Register Masks
* @brief Register Masks for ADC
* @{
*/
/* ------- CTRL1 Bit Fields                         ------ */
#define ADC_CTRL1_SMODE_MASK                     (0x7U)                                              /*!< ADC0_CTRL1.SMODE Mask                   */
#define ADC_CTRL1_SMODE_SHIFT                    (0U)                                                /*!< ADC0_CTRL1.SMODE Position               */
#define ADC_CTRL1_SMODE(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0x7UL)           /*!< ADC0_CTRL1.SMODE Field                  */
#define ADC_CTRL1_CHNCFG_L_MASK                  (0xF0U)                                             /*!< ADC0_CTRL1.CHNCFG_L Mask                */
#define ADC_CTRL1_CHNCFG_L_SHIFT                 (4U)                                                /*!< ADC0_CTRL1.CHNCFG_L Position            */
#define ADC_CTRL1_CHNCFG_L(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CTRL1.CHNCFG_L Field               */
#define ADC_CTRL1_HLMTIE_MASK                    (0x100U)                                            /*!< ADC0_CTRL1.HLMTIE Mask                  */
#define ADC_CTRL1_HLMTIE_SHIFT                   (8U)                                                /*!< ADC0_CTRL1.HLMTIE Position              */
#define ADC_CTRL1_HLMTIE(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< ADC0_CTRL1.HLMTIE Field                 */
#define ADC_CTRL1_LLMTIE_MASK                    (0x200U)                                            /*!< ADC0_CTRL1.LLMTIE Mask                  */
#define ADC_CTRL1_LLMTIE_SHIFT                   (9U)                                                /*!< ADC0_CTRL1.LLMTIE Position              */
#define ADC_CTRL1_LLMTIE(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< ADC0_CTRL1.LLMTIE Field                 */
#define ADC_CTRL1_ZCIE_MASK                      (0x400U)                                            /*!< ADC0_CTRL1.ZCIE Mask                    */
#define ADC_CTRL1_ZCIE_SHIFT                     (10U)                                               /*!< ADC0_CTRL1.ZCIE Position                */
#define ADC_CTRL1_ZCIE(x)                        (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< ADC0_CTRL1.ZCIE Field                   */
#define ADC_CTRL1_EOSIE0_MASK                    (0x800U)                                            /*!< ADC0_CTRL1.EOSIE0 Mask                  */
#define ADC_CTRL1_EOSIE0_SHIFT                   (11U)                                               /*!< ADC0_CTRL1.EOSIE0 Position              */
#define ADC_CTRL1_EOSIE0(x)                      (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< ADC0_CTRL1.EOSIE0 Field                 */
#define ADC_CTRL1_SYNC0_MASK                     (0x1000U)                                           /*!< ADC0_CTRL1.SYNC0 Mask                   */
#define ADC_CTRL1_SYNC0_SHIFT                    (12U)                                               /*!< ADC0_CTRL1.SYNC0 Position               */
#define ADC_CTRL1_SYNC0(x)                       (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< ADC0_CTRL1.SYNC0 Field                  */
#define ADC_CTRL1_START0_MASK                    (0x2000U)                                           /*!< ADC0_CTRL1.START0 Mask                  */
#define ADC_CTRL1_START0_SHIFT                   (13U)                                               /*!< ADC0_CTRL1.START0 Position              */
#define ADC_CTRL1_START0(x)                      (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< ADC0_CTRL1.START0 Field                 */
#define ADC_CTRL1_STOP0_MASK                     (0x4000U)                                           /*!< ADC0_CTRL1.STOP0 Mask                   */
#define ADC_CTRL1_STOP0_SHIFT                    (14U)                                               /*!< ADC0_CTRL1.STOP0 Position               */
#define ADC_CTRL1_STOP0(x)                       (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ADC0_CTRL1.STOP0 Field                  */
#define ADC_CTRL1_DMAEN0_MASK                    (0x8000U)                                           /*!< ADC0_CTRL1.DMAEN0 Mask                  */
#define ADC_CTRL1_DMAEN0_SHIFT                   (15U)                                               /*!< ADC0_CTRL1.DMAEN0 Position              */
#define ADC_CTRL1_DMAEN0(x)                      (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_CTRL1.DMAEN0 Field                 */
/* ------- CTRL2 Bit Fields                         ------ */
#define ADC_CTRL2_DIV0_MASK                      (0x3FU)                                             /*!< ADC0_CTRL2.DIV0 Mask                    */
#define ADC_CTRL2_DIV0_SHIFT                     (0U)                                                /*!< ADC0_CTRL2.DIV0 Position                */
#define ADC_CTRL2_DIV0(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< ADC0_CTRL2.DIV0 Field                   */
#define ADC_CTRL2_SIMULT_MASK                    (0x40U)                                             /*!< ADC0_CTRL2.SIMULT Mask                  */
#define ADC_CTRL2_SIMULT_SHIFT                   (6U)                                                /*!< ADC0_CTRL2.SIMULT Position              */
#define ADC_CTRL2_SIMULT(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< ADC0_CTRL2.SIMULT Field                 */
#define ADC_CTRL2_CHNCFG_H_MASK                  (0x780U)                                            /*!< ADC0_CTRL2.CHNCFG_H Mask                */
#define ADC_CTRL2_CHNCFG_H_SHIFT                 (7U)                                                /*!< ADC0_CTRL2.CHNCFG_H Position            */
#define ADC_CTRL2_CHNCFG_H(x)                    (((uint16_t)(((uint16_t)(x))<<7U))&0x780UL)         /*!< ADC0_CTRL2.CHNCFG_H Field               */
#define ADC_CTRL2_EOSIE1_MASK                    (0x800U)                                            /*!< ADC0_CTRL2.EOSIE1 Mask                  */
#define ADC_CTRL2_EOSIE1_SHIFT                   (11U)                                               /*!< ADC0_CTRL2.EOSIE1 Position              */
#define ADC_CTRL2_EOSIE1(x)                      (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< ADC0_CTRL2.EOSIE1 Field                 */
#define ADC_CTRL2_SYNC1_MASK                     (0x1000U)                                           /*!< ADC0_CTRL2.SYNC1 Mask                   */
#define ADC_CTRL2_SYNC1_SHIFT                    (12U)                                               /*!< ADC0_CTRL2.SYNC1 Position               */
#define ADC_CTRL2_SYNC1(x)                       (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< ADC0_CTRL2.SYNC1 Field                  */
#define ADC_CTRL2_START1_MASK                    (0x2000U)                                           /*!< ADC0_CTRL2.START1 Mask                  */
#define ADC_CTRL2_START1_SHIFT                   (13U)                                               /*!< ADC0_CTRL2.START1 Position              */
#define ADC_CTRL2_START1(x)                      (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< ADC0_CTRL2.START1 Field                 */
#define ADC_CTRL2_STOP1_MASK                     (0x4000U)                                           /*!< ADC0_CTRL2.STOP1 Mask                   */
#define ADC_CTRL2_STOP1_SHIFT                    (14U)                                               /*!< ADC0_CTRL2.STOP1 Position               */
#define ADC_CTRL2_STOP1(x)                       (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ADC0_CTRL2.STOP1 Field                  */
#define ADC_CTRL2_DMAEN1_MASK                    (0x8000U)                                           /*!< ADC0_CTRL2.DMAEN1 Mask                  */
#define ADC_CTRL2_DMAEN1_SHIFT                   (15U)                                               /*!< ADC0_CTRL2.DMAEN1 Position              */
#define ADC_CTRL2_DMAEN1(x)                      (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_CTRL2.DMAEN1 Field                 */
/* ------- ZXCTRL1 Bit Fields                       ------ */
#define ADC_ZXCTRL1_ZCE0_MASK                    (0x3U)                                              /*!< ADC0_ZXCTRL1.ZCE0 Mask                  */
#define ADC_ZXCTRL1_ZCE0_SHIFT                   (0U)                                                /*!< ADC0_ZXCTRL1.ZCE0 Position              */
#define ADC_ZXCTRL1_ZCE0(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< ADC0_ZXCTRL1.ZCE0 Field                 */
#define ADC_ZXCTRL1_ZCE1_MASK                    (0xCU)                                              /*!< ADC0_ZXCTRL1.ZCE1 Mask                  */
#define ADC_ZXCTRL1_ZCE1_SHIFT                   (2U)                                                /*!< ADC0_ZXCTRL1.ZCE1 Position              */
#define ADC_ZXCTRL1_ZCE1(x)                      (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< ADC0_ZXCTRL1.ZCE1 Field                 */
#define ADC_ZXCTRL1_ZCE2_MASK                    (0x30U)                                             /*!< ADC0_ZXCTRL1.ZCE2 Mask                  */
#define ADC_ZXCTRL1_ZCE2_SHIFT                   (4U)                                                /*!< ADC0_ZXCTRL1.ZCE2 Position              */
#define ADC_ZXCTRL1_ZCE2(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< ADC0_ZXCTRL1.ZCE2 Field                 */
#define ADC_ZXCTRL1_ZCE3_MASK                    (0xC0U)                                             /*!< ADC0_ZXCTRL1.ZCE3 Mask                  */
#define ADC_ZXCTRL1_ZCE3_SHIFT                   (6U)                                                /*!< ADC0_ZXCTRL1.ZCE3 Position              */
#define ADC_ZXCTRL1_ZCE3(x)                      (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< ADC0_ZXCTRL1.ZCE3 Field                 */
#define ADC_ZXCTRL1_ZCE4_MASK                    (0x300U)                                            /*!< ADC0_ZXCTRL1.ZCE4 Mask                  */
#define ADC_ZXCTRL1_ZCE4_SHIFT                   (8U)                                                /*!< ADC0_ZXCTRL1.ZCE4 Position              */
#define ADC_ZXCTRL1_ZCE4(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< ADC0_ZXCTRL1.ZCE4 Field                 */
#define ADC_ZXCTRL1_ZCE5_MASK                    (0xC00U)                                            /*!< ADC0_ZXCTRL1.ZCE5 Mask                  */
#define ADC_ZXCTRL1_ZCE5_SHIFT                   (10U)                                               /*!< ADC0_ZXCTRL1.ZCE5 Position              */
#define ADC_ZXCTRL1_ZCE5(x)                      (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< ADC0_ZXCTRL1.ZCE5 Field                 */
#define ADC_ZXCTRL1_ZCE6_MASK                    (0x3000U)                                           /*!< ADC0_ZXCTRL1.ZCE6 Mask                  */
#define ADC_ZXCTRL1_ZCE6_SHIFT                   (12U)                                               /*!< ADC0_ZXCTRL1.ZCE6 Position              */
#define ADC_ZXCTRL1_ZCE6(x)                      (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< ADC0_ZXCTRL1.ZCE6 Field                 */
#define ADC_ZXCTRL1_ZCE7_MASK                    (0xC000U)                                           /*!< ADC0_ZXCTRL1.ZCE7 Mask                  */
#define ADC_ZXCTRL1_ZCE7_SHIFT                   (14U)                                               /*!< ADC0_ZXCTRL1.ZCE7 Position              */
#define ADC_ZXCTRL1_ZCE7(x)                      (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< ADC0_ZXCTRL1.ZCE7 Field                 */
/* ------- ZXCTRL2 Bit Fields                       ------ */
#define ADC_ZXCTRL2_ZCE8_MASK                    (0x3U)                                              /*!< ADC0_ZXCTRL2.ZCE8 Mask                  */
#define ADC_ZXCTRL2_ZCE8_SHIFT                   (0U)                                                /*!< ADC0_ZXCTRL2.ZCE8 Position              */
#define ADC_ZXCTRL2_ZCE8(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< ADC0_ZXCTRL2.ZCE8 Field                 */
#define ADC_ZXCTRL2_ZCE9_MASK                    (0xCU)                                              /*!< ADC0_ZXCTRL2.ZCE9 Mask                  */
#define ADC_ZXCTRL2_ZCE9_SHIFT                   (2U)                                                /*!< ADC0_ZXCTRL2.ZCE9 Position              */
#define ADC_ZXCTRL2_ZCE9(x)                      (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< ADC0_ZXCTRL2.ZCE9 Field                 */
#define ADC_ZXCTRL2_ZCE10_MASK                   (0x30U)                                             /*!< ADC0_ZXCTRL2.ZCE10 Mask                 */
#define ADC_ZXCTRL2_ZCE10_SHIFT                  (4U)                                                /*!< ADC0_ZXCTRL2.ZCE10 Position             */
#define ADC_ZXCTRL2_ZCE10(x)                     (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< ADC0_ZXCTRL2.ZCE10 Field                */
#define ADC_ZXCTRL2_ZCE11_MASK                   (0xC0U)                                             /*!< ADC0_ZXCTRL2.ZCE11 Mask                 */
#define ADC_ZXCTRL2_ZCE11_SHIFT                  (6U)                                                /*!< ADC0_ZXCTRL2.ZCE11 Position             */
#define ADC_ZXCTRL2_ZCE11(x)                     (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< ADC0_ZXCTRL2.ZCE11 Field                */
#define ADC_ZXCTRL2_ZCE12_MASK                   (0x300U)                                            /*!< ADC0_ZXCTRL2.ZCE12 Mask                 */
#define ADC_ZXCTRL2_ZCE12_SHIFT                  (8U)                                                /*!< ADC0_ZXCTRL2.ZCE12 Position             */
#define ADC_ZXCTRL2_ZCE12(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< ADC0_ZXCTRL2.ZCE12 Field                */
#define ADC_ZXCTRL2_ZCE13_MASK                   (0xC00U)                                            /*!< ADC0_ZXCTRL2.ZCE13 Mask                 */
#define ADC_ZXCTRL2_ZCE13_SHIFT                  (10U)                                               /*!< ADC0_ZXCTRL2.ZCE13 Position             */
#define ADC_ZXCTRL2_ZCE13(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< ADC0_ZXCTRL2.ZCE13 Field                */
#define ADC_ZXCTRL2_ZCE14_MASK                   (0x3000U)                                           /*!< ADC0_ZXCTRL2.ZCE14 Mask                 */
#define ADC_ZXCTRL2_ZCE14_SHIFT                  (12U)                                               /*!< ADC0_ZXCTRL2.ZCE14 Position             */
#define ADC_ZXCTRL2_ZCE14(x)                     (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< ADC0_ZXCTRL2.ZCE14 Field                */
#define ADC_ZXCTRL2_ZCE15_MASK                   (0xC000U)                                           /*!< ADC0_ZXCTRL2.ZCE15 Mask                 */
#define ADC_ZXCTRL2_ZCE15_SHIFT                  (14U)                                               /*!< ADC0_ZXCTRL2.ZCE15 Position             */
#define ADC_ZXCTRL2_ZCE15(x)                     (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< ADC0_ZXCTRL2.ZCE15 Field                */
/* ------- CLIST1 Bit Fields                        ------ */
#define ADC_CLIST1_SAMPLE0_MASK                  (0xFU)                                              /*!< ADC0_CLIST1.SAMPLE0 Mask                */
#define ADC_CLIST1_SAMPLE0_SHIFT                 (0U)                                                /*!< ADC0_CLIST1.SAMPLE0 Position            */
#define ADC_CLIST1_SAMPLE0(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST1.SAMPLE0 Field               */
#define ADC_CLIST1_SAMPLE1_MASK                  (0xF0U)                                             /*!< ADC0_CLIST1.SAMPLE1 Mask                */
#define ADC_CLIST1_SAMPLE1_SHIFT                 (4U)                                                /*!< ADC0_CLIST1.SAMPLE1 Position            */
#define ADC_CLIST1_SAMPLE1(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST1.SAMPLE1 Field               */
#define ADC_CLIST1_SAMPLE2_MASK                  (0xF00U)                                            /*!< ADC0_CLIST1.SAMPLE2 Mask                */
#define ADC_CLIST1_SAMPLE2_SHIFT                 (8U)                                                /*!< ADC0_CLIST1.SAMPLE2 Position            */
#define ADC_CLIST1_SAMPLE2(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST1.SAMPLE2 Field               */
#define ADC_CLIST1_SAMPLE3_MASK                  (0xF000U)                                           /*!< ADC0_CLIST1.SAMPLE3 Mask                */
#define ADC_CLIST1_SAMPLE3_SHIFT                 (12U)                                               /*!< ADC0_CLIST1.SAMPLE3 Position            */
#define ADC_CLIST1_SAMPLE3(x)                    (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST1.SAMPLE3 Field               */
/* ------- CLIST2 Bit Fields                        ------ */
#define ADC_CLIST2_SAMPLE4_MASK                  (0xFU)                                              /*!< ADC0_CLIST2.SAMPLE4 Mask                */
#define ADC_CLIST2_SAMPLE4_SHIFT                 (0U)                                                /*!< ADC0_CLIST2.SAMPLE4 Position            */
#define ADC_CLIST2_SAMPLE4(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST2.SAMPLE4 Field               */
#define ADC_CLIST2_SAMPLE5_MASK                  (0xF0U)                                             /*!< ADC0_CLIST2.SAMPLE5 Mask                */
#define ADC_CLIST2_SAMPLE5_SHIFT                 (4U)                                                /*!< ADC0_CLIST2.SAMPLE5 Position            */
#define ADC_CLIST2_SAMPLE5(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST2.SAMPLE5 Field               */
#define ADC_CLIST2_SAMPLE6_MASK                  (0xF00U)                                            /*!< ADC0_CLIST2.SAMPLE6 Mask                */
#define ADC_CLIST2_SAMPLE6_SHIFT                 (8U)                                                /*!< ADC0_CLIST2.SAMPLE6 Position            */
#define ADC_CLIST2_SAMPLE6(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST2.SAMPLE6 Field               */
#define ADC_CLIST2_SAMPLE7_MASK                  (0xF000U)                                           /*!< ADC0_CLIST2.SAMPLE7 Mask                */
#define ADC_CLIST2_SAMPLE7_SHIFT                 (12U)                                               /*!< ADC0_CLIST2.SAMPLE7 Position            */
#define ADC_CLIST2_SAMPLE7(x)                    (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST2.SAMPLE7 Field               */
/* ------- CLIST3 Bit Fields                        ------ */
#define ADC_CLIST3_SAMPLE8_MASK                  (0xFU)                                              /*!< ADC0_CLIST3.SAMPLE8 Mask                */
#define ADC_CLIST3_SAMPLE8_SHIFT                 (0U)                                                /*!< ADC0_CLIST3.SAMPLE8 Position            */
#define ADC_CLIST3_SAMPLE8(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST3.SAMPLE8 Field               */
#define ADC_CLIST3_SAMPLE9_MASK                  (0xF0U)                                             /*!< ADC0_CLIST3.SAMPLE9 Mask                */
#define ADC_CLIST3_SAMPLE9_SHIFT                 (4U)                                                /*!< ADC0_CLIST3.SAMPLE9 Position            */
#define ADC_CLIST3_SAMPLE9(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST3.SAMPLE9 Field               */
#define ADC_CLIST3_SAMPLE10_MASK                 (0xF00U)                                            /*!< ADC0_CLIST3.SAMPLE10 Mask               */
#define ADC_CLIST3_SAMPLE10_SHIFT                (8U)                                                /*!< ADC0_CLIST3.SAMPLE10 Position           */
#define ADC_CLIST3_SAMPLE10(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST3.SAMPLE10 Field              */
#define ADC_CLIST3_SAMPLE11_MASK                 (0xF000U)                                           /*!< ADC0_CLIST3.SAMPLE11 Mask               */
#define ADC_CLIST3_SAMPLE11_SHIFT                (12U)                                               /*!< ADC0_CLIST3.SAMPLE11 Position           */
#define ADC_CLIST3_SAMPLE11(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST3.SAMPLE11 Field              */
/* ------- CLIST4 Bit Fields                        ------ */
#define ADC_CLIST4_SAMPLE12_MASK                 (0xFU)                                              /*!< ADC0_CLIST4.SAMPLE12 Mask               */
#define ADC_CLIST4_SAMPLE12_SHIFT                (0U)                                                /*!< ADC0_CLIST4.SAMPLE12 Position           */
#define ADC_CLIST4_SAMPLE12(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST4.SAMPLE12 Field              */
#define ADC_CLIST4_SAMPLE13_MASK                 (0xF0U)                                             /*!< ADC0_CLIST4.SAMPLE13 Mask               */
#define ADC_CLIST4_SAMPLE13_SHIFT                (4U)                                                /*!< ADC0_CLIST4.SAMPLE13 Position           */
#define ADC_CLIST4_SAMPLE13(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST4.SAMPLE13 Field              */
#define ADC_CLIST4_SAMPLE14_MASK                 (0xF00U)                                            /*!< ADC0_CLIST4.SAMPLE14 Mask               */
#define ADC_CLIST4_SAMPLE14_SHIFT                (8U)                                                /*!< ADC0_CLIST4.SAMPLE14 Position           */
#define ADC_CLIST4_SAMPLE14(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST4.SAMPLE14 Field              */
#define ADC_CLIST4_SAMPLE15_MASK                 (0xF000U)                                           /*!< ADC0_CLIST4.SAMPLE15 Mask               */
#define ADC_CLIST4_SAMPLE15_SHIFT                (12U)                                               /*!< ADC0_CLIST4.SAMPLE15 Position           */
#define ADC_CLIST4_SAMPLE15(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST4.SAMPLE15 Field              */
/* ------- SDIS Bit Fields                          ------ */
#define ADC_SDIS_DS_MASK                         (0xFFFFU)                                           /*!< ADC0_SDIS.DS Mask                       */
#define ADC_SDIS_DS_SHIFT                        (0U)                                                /*!< ADC0_SDIS.DS Position                   */
#define ADC_SDIS_DS(x)                           (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_SDIS.DS Field                      */
/* ------- STAT Bit Fields                          ------ */
#define ADC_STAT_UNDEFINED_MASK                  (0xFFU)                                             /*!< ADC0_STAT.UNDEFINED Mask                */
#define ADC_STAT_UNDEFINED_SHIFT                 (0U)                                                /*!< ADC0_STAT.UNDEFINED Position            */
#define ADC_STAT_UNDEFINED(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< ADC0_STAT.UNDEFINED Field               */
