podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV40F16.h
/**
* @addtogroup WDOG_Register_Masks_GROUP WDOG Register Masks
* @brief Register Masks for WDOG
* @{
*/
/* ------- STCTRLH Bit Fields                       ------ */
#define WDOG_STCTRLH_WDOGEN_MASK                 (0x1U)                                              /*!< WDOG_STCTRLH.WDOGEN Mask                */
#define WDOG_STCTRLH_WDOGEN_SHIFT                (0U)                                                /*!< WDOG_STCTRLH.WDOGEN Position            */
#define WDOG_STCTRLH_WDOGEN(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< WDOG_STCTRLH.WDOGEN Field               */
#define WDOG_STCTRLH_CLKSRC_MASK                 (0x2U)                                              /*!< WDOG_STCTRLH.CLKSRC Mask                */
#define WDOG_STCTRLH_CLKSRC_SHIFT                (1U)                                                /*!< WDOG_STCTRLH.CLKSRC Position            */
#define WDOG_STCTRLH_CLKSRC(x)                   (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< WDOG_STCTRLH.CLKSRC Field               */
#define WDOG_STCTRLH_IRQRSTEN_MASK               (0x4U)                                              /*!< WDOG_STCTRLH.IRQRSTEN Mask              */
#define WDOG_STCTRLH_IRQRSTEN_SHIFT              (2U)                                                /*!< WDOG_STCTRLH.IRQRSTEN Position          */
#define WDOG_STCTRLH_IRQRSTEN(x)                 (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< WDOG_STCTRLH.IRQRSTEN Field             */
#define WDOG_STCTRLH_WINEN_MASK                  (0x8U)                                              /*!< WDOG_STCTRLH.WINEN Mask                 */
#define WDOG_STCTRLH_WINEN_SHIFT                 (3U)                                                /*!< WDOG_STCTRLH.WINEN Position             */
#define WDOG_STCTRLH_WINEN(x)                    (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< WDOG_STCTRLH.WINEN Field                */
#define WDOG_STCTRLH_ALLOWUPDATE_MASK            (0x10U)                                             /*!< WDOG_STCTRLH.ALLOWUPDATE Mask           */
#define WDOG_STCTRLH_ALLOWUPDATE_SHIFT           (4U)                                                /*!< WDOG_STCTRLH.ALLOWUPDATE Position       */
#define WDOG_STCTRLH_ALLOWUPDATE(x)              (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< WDOG_STCTRLH.ALLOWUPDATE Field          */
#define WDOG_STCTRLH_DBGEN_MASK                  (0x20U)                                             /*!< WDOG_STCTRLH.DBGEN Mask                 */
#define WDOG_STCTRLH_DBGEN_SHIFT                 (5U)                                                /*!< WDOG_STCTRLH.DBGEN Position             */
#define WDOG_STCTRLH_DBGEN(x)                    (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< WDOG_STCTRLH.DBGEN Field                */
#define WDOG_STCTRLH_STOPEN_MASK                 (0x40U)                                             /*!< WDOG_STCTRLH.STOPEN Mask                */
#define WDOG_STCTRLH_STOPEN_SHIFT                (6U)                                                /*!< WDOG_STCTRLH.STOPEN Position            */
#define WDOG_STCTRLH_STOPEN(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< WDOG_STCTRLH.STOPEN Field               */
#define WDOG_STCTRLH_WAITEN_MASK                 (0x80U)                                             /*!< WDOG_STCTRLH.WAITEN Mask                */
#define WDOG_STCTRLH_WAITEN_SHIFT                (7U)                                                /*!< WDOG_STCTRLH.WAITEN Position            */
#define WDOG_STCTRLH_WAITEN(x)                   (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< WDOG_STCTRLH.WAITEN Field               */
#define WDOG_STCTRLH_TESTWDOG_MASK               (0x400U)                                            /*!< WDOG_STCTRLH.TESTWDOG Mask              */
#define WDOG_STCTRLH_TESTWDOG_SHIFT              (10U)                                               /*!< WDOG_STCTRLH.TESTWDOG Position          */
#define WDOG_STCTRLH_TESTWDOG(x)                 (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< WDOG_STCTRLH.TESTWDOG Field             */
#define WDOG_STCTRLH_TESTSEL_MASK                (0x800U)                                            /*!< WDOG_STCTRLH.TESTSEL Mask               */
#define WDOG_STCTRLH_TESTSEL_SHIFT               (11U)                                               /*!< WDOG_STCTRLH.TESTSEL Position           */
#define WDOG_STCTRLH_TESTSEL(x)                  (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< WDOG_STCTRLH.TESTSEL Field              */
#define WDOG_STCTRLH_BYTESEL_MASK                (0x3000U)                                           /*!< WDOG_STCTRLH.BYTESEL Mask               */
#define WDOG_STCTRLH_BYTESEL_SHIFT               (12U)                                               /*!< WDOG_STCTRLH.BYTESEL Position           */
#define WDOG_STCTRLH_BYTESEL(x)                  (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< WDOG_STCTRLH.BYTESEL Field              */
#define WDOG_STCTRLH_DISTESTWDOG_MASK            (0x4000U)                                           /*!< WDOG_STCTRLH.DISTESTWDOG Mask           */
#define WDOG_STCTRLH_DISTESTWDOG_SHIFT           (14U)                                               /*!< WDOG_STCTRLH.DISTESTWDOG Position       */
#define WDOG_STCTRLH_DISTESTWDOG(x)              (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< WDOG_STCTRLH.DISTESTWDOG Field          */
/* ------- STCTRLL Bit Fields                       ------ */
#define WDOG_STCTRLL_INTFLG_MASK                 (0x8000U)                                           /*!< WDOG_STCTRLL.INTFLG Mask                */
#define WDOG_STCTRLL_INTFLG_SHIFT                (15U)                                               /*!< WDOG_STCTRLL.INTFLG Position            */
#define WDOG_STCTRLL_INTFLG(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< WDOG_STCTRLL.INTFLG Field               */
/* ------- TOVALH Bit Fields                        ------ */
#define WDOG_TOVALH_TOVALHIGH_MASK               (0xFFFFU)                                           /*!< WDOG_TOVALH.TOVALHIGH Mask              */
#define WDOG_TOVALH_TOVALHIGH_SHIFT              (0U)                                                /*!< WDOG_TOVALH.TOVALHIGH Position          */
#define WDOG_TOVALH_TOVALHIGH(x)                 (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_TOVALH.TOVALHIGH Field             */
/* ------- TOVALL Bit Fields                        ------ */
#define WDOG_TOVALL_TOVALLOW_MASK                (0xFFFFU)                                           /*!< WDOG_TOVALL.TOVALLOW Mask               */
#define WDOG_TOVALL_TOVALLOW_SHIFT               (0U)                                                /*!< WDOG_TOVALL.TOVALLOW Position           */
#define WDOG_TOVALL_TOVALLOW(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_TOVALL.TOVALLOW Field              */
/* ------- WINH Bit Fields                          ------ */
#define WDOG_WINH_WINHIGH_MASK                   (0xFFFFU)                                           /*!< WDOG_WINH.WINHIGH Mask                  */
#define WDOG_WINH_WINHIGH_SHIFT                  (0U)                                                /*!< WDOG_WINH.WINHIGH Position              */
#define WDOG_WINH_WINHIGH(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_WINH.WINHIGH Field                 */
/* ------- WINL Bit Fields                          ------ */
#define WDOG_WINL_WINLOW_MASK                    (0xFFFFU)                                           /*!< WDOG_WINL.WINLOW Mask                   */
#define WDOG_WINL_WINLOW_SHIFT                   (0U)                                                /*!< WDOG_WINL.WINLOW Position               */
#define WDOG_WINL_WINLOW(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_WINL.WINLOW Field                  */
/* ------- REFRESH Bit Fields                       ------ */
#define WDOG_REFRESH_WDOGREFRESH_MASK            (0xFFFFU)                                           /*!< WDOG_REFRESH.WDOGREFRESH Mask           */
#define WDOG_REFRESH_WDOGREFRESH_SHIFT           (0U)                                                /*!< WDOG_REFRESH.WDOGREFRESH Position       */
#define WDOG_REFRESH_WDOGREFRESH(x)              (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_REFRESH.WDOGREFRESH Field          */
/* ------- UNLOCK Bit Fields                        ------ */
#define WDOG_UNLOCK_WDOGUNLOCK_MASK              (0xFFFFU)                                           /*!< WDOG_UNLOCK.WDOGUNLOCK Mask             */
#define WDOG_UNLOCK_WDOGUNLOCK_SHIFT             (0U)                                                /*!< WDOG_UNLOCK.WDOGUNLOCK Position         */
#define WDOG_UNLOCK_WDOGUNLOCK(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_UNLOCK.WDOGUNLOCK Field            */
/* ------- TMROUTH Bit Fields                       ------ */
#define WDOG_TMROUTH_TIMEROUTHIGH_MASK           (0xFFFFU)                                           /*!< WDOG_TMROUTH.TIMEROUTHIGH Mask          */
#define WDOG_TMROUTH_TIMEROUTHIGH_SHIFT          (0U)                                                /*!< WDOG_TMROUTH.TIMEROUTHIGH Position      */
#define WDOG_TMROUTH_TIMEROUTHIGH(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_TMROUTH.TIMEROUTHIGH Field         */
/* ------- TMROUTL Bit Fields                       ------ */
#define WDOG_TMROUTL_TIMEROUTLOW_MASK            (0xFFFFU)                                           /*!< WDOG_TMROUTL.TIMEROUTLOW Mask           */
#define WDOG_TMROUTL_TIMEROUTLOW_SHIFT           (0U)                                                /*!< WDOG_TMROUTL.TIMEROUTLOW Position       */
#define WDOG_TMROUTL_TIMEROUTLOW(x)              (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_TMROUTL.TIMEROUTLOW Field          */
/* ------- RSTCNT Bit Fields                        ------ */
#define WDOG_RSTCNT_RSTCNT_MASK                  (0xFFFFU)                                           /*!< WDOG_RSTCNT.RSTCNT Mask                 */
#define WDOG_RSTCNT_RSTCNT_SHIFT                 (0U)                                                /*!< WDOG_RSTCNT.RSTCNT Position             */
#define WDOG_RSTCNT_RSTCNT(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< WDOG_RSTCNT.RSTCNT Field                */
/* ------- PRESC Bit Fields                         ------ */
#define WDOG_PRESC_PRESCVAL_MASK                 (0x700U)                                            /*!< WDOG_PRESC.PRESCVAL Mask                */
#define WDOG_PRESC_PRESCVAL_SHIFT                (8U)                                                /*!< WDOG_PRESC.PRESCVAL Position            */
#define WDOG_PRESC_PRESCVAL(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x700UL)         /*!< WDOG_PRESC.PRESCVAL Field               */
/**
 * @} */ /* End group WDOG_Register_Masks_GROUP 
 */

/* WDOG - Peripheral instance base addresses */
#define WDOG_BasePtr                   0x40052000UL //!< Peripheral base address
#define WDOG                           ((WDOG_Type *) WDOG_BasePtr) //!< Freescale base pointer
#define WDOG_BASE_PTR                  (WDOG) //!< Freescale style base pointer
/**
 * @} */ /* End group WDOG_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup XBARA_Peripheral_access_layer_GROUP XBARA Peripheral Access Layer
* @brief C Struct for XBARA
* @{
*/

/* ================================================================================ */
/* ================           XBARA (file:XBARA_MKV30)             ================ */
/* ================================================================================ */

/**
 * @brief Crossbar Switch
 */
/**
* @addtogroup XBARA_structs_GROUP XBARA struct
* @brief Struct for XBARA
* @{
*/
typedef struct XBARA_Type {
   __IO uint16_t  SEL[30];                      /**< 0000: Crossbar Select Register                                     */
   __IO uint16_t  CTRL0;                        /**< 003C: Crossbar A Control Register 0                                */
   __IO uint16_t  CTRL1;                        /**< 003E: Crossbar A Control Register 1                                */
} XBARA_Type;

/**
 * @} */ /* End group XBARA_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'XBARA' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup XBARA_Register_Masks_GROUP XBARA Register Masks
* @brief Register Masks for XBARA
* @{
*/
/* ------- SEL Bit Fields                           ------ */
#define XBARA_SEL_SEL0_MASK                      (0x3FU)                                             /*!< XBARA_SEL.SEL0 Mask                     */
#define XBARA_SEL_SEL0_SHIFT                     (0U)                                                /*!< XBARA_SEL.SEL0 Position                 */
#define XBARA_SEL_SEL0(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL.SEL0 Field                    */
#define XBARA_SEL_SEL1_MASK                      (0x3F00U)                                           /*!< XBARA_SEL.SEL1 Mask                     */
#define XBARA_SEL_SEL1_SHIFT                     (8U)                                                /*!< XBARA_SEL.SEL1 Position                 */
#define XBARA_SEL_SEL1(x)                        (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL.SEL1 Field                    */
/* ------- CTRL0 Bit Fields                         ------ */
#define XBARA_CTRL0_DEN0_MASK                    (0x1U)                                              /*!< XBARA_CTRL0.DEN0 Mask                   */
#define XBARA_CTRL0_DEN0_SHIFT                   (0U)                                                /*!< XBARA_CTRL0.DEN0 Position               */
#define XBARA_CTRL0_DEN0(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< XBARA_CTRL0.DEN0 Field                  */
#define XBARA_CTRL0_IEN0_MASK                    (0x2U)                                              /*!< XBARA_CTRL0.IEN0 Mask                   */
#define XBARA_CTRL0_IEN0_SHIFT                   (1U)                                                /*!< XBARA_CTRL0.IEN0 Position               */
#define XBARA_CTRL0_IEN0(x)                      (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< XBARA_CTRL0.IEN0 Field                  */
#define XBARA_CTRL0_EDGE0_MASK                   (0xCU)                                              /*!< XBARA_CTRL0.EDGE0 Mask                  */
#define XBARA_CTRL0_EDGE0_SHIFT                  (2U)                                                /*!< XBARA_CTRL0.EDGE0 Position              */
#define XBARA_CTRL0_EDGE0(x)                     (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< XBARA_CTRL0.EDGE0 Field                 */
#define XBARA_CTRL0_STS0_MASK                    (0x10U)                                             /*!< XBARA_CTRL0.STS0 Mask                   */
#define XBARA_CTRL0_STS0_SHIFT                   (4U)                                                /*!< XBARA_CTRL0.STS0 Position               */
#define XBARA_CTRL0_STS0(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< XBARA_CTRL0.STS0 Field                  */
#define XBARA_CTRL0_DEN1_MASK                    (0x100U)                                            /*!< XBARA_CTRL0.DEN1 Mask                   */
#define XBARA_CTRL0_DEN1_SHIFT                   (8U)                                                /*!< XBARA_CTRL0.DEN1 Position               */
#define XBARA_CTRL0_DEN1(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< XBARA_CTRL0.DEN1 Field                  */
#define XBARA_CTRL0_IEN1_MASK                    (0x200U)                                            /*!< XBARA_CTRL0.IEN1 Mask                   */
#define XBARA_CTRL0_IEN1_SHIFT                   (9U)                                                /*!< XBARA_CTRL0.IEN1 Position               */
#define XBARA_CTRL0_IEN1(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< XBARA_CTRL0.IEN1 Field                  */
#define XBARA_CTRL0_EDGE1_MASK                   (0xC00U)                                            /*!< XBARA_CTRL0.EDGE1 Mask                  */
#define XBARA_CTRL0_EDGE1_SHIFT                  (10U)                                               /*!< XBARA_CTRL0.EDGE1 Position              */
#define XBARA_CTRL0_EDGE1(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< XBARA_CTRL0.EDGE1 Field                 */
#define XBARA_CTRL0_STS1_MASK                    (0x1000U)                                           /*!< XBARA_CTRL0.STS1 Mask                   */
#define XBARA_CTRL0_STS1_SHIFT                   (12U)                                               /*!< XBARA_CTRL0.STS1 Position               */
#define XBARA_CTRL0_STS1(x)                      (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< XBARA_CTRL0.STS1 Field                  */
/* ------- CTRL1 Bit Fields                         ------ */
#define XBARA_CTRL1_DEN2_MASK                    (0x1U)                                              /*!< XBARA_CTRL1.DEN2 Mask                   */
#define XBARA_CTRL1_DEN2_SHIFT                   (0U)                                                /*!< XBARA_CTRL1.DEN2 Position               */
#define XBARA_CTRL1_DEN2(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< XBARA_CTRL1.DEN2 Field                  */
#define XBARA_CTRL1_IEN2_MASK                    (0x2U)                                              /*!< XBARA_CTRL1.IEN2 Mask                   */
#define XBARA_CTRL1_IEN2_SHIFT                   (1U)                                                /*!< XBARA_CTRL1.IEN2 Position               */
#define XBARA_CTRL1_IEN2(x)                      (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< XBARA_CTRL1.IEN2 Field                  */
#define XBARA_CTRL1_EDGE2_MASK                   (0xCU)                                              /*!< XBARA_CTRL1.EDGE2 Mask                  */
#define XBARA_CTRL1_EDGE2_SHIFT                  (2U)                                                /*!< XBARA_CTRL1.EDGE2 Position              */
#define XBARA_CTRL1_EDGE2(x)                     (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< XBARA_CTRL1.EDGE2 Field                 */
#define XBARA_CTRL1_STS2_MASK                    (0x10U)                                             /*!< XBARA_CTRL1.STS2 Mask                   */
#define XBARA_CTRL1_STS2_SHIFT                   (4U)                                                /*!< XBARA_CTRL1.STS2 Position               */
#define XBARA_CTRL1_STS2(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< XBARA_CTRL1.STS2 Field                  */
#define XBARA_CTRL1_DEN3_MASK                    (0x100U)                                            /*!< XBARA_CTRL1.DEN3 Mask                   */
#define XBARA_CTRL1_DEN3_SHIFT                   (8U)                                                /*!< XBARA_CTRL1.DEN3 Position               */
#define XBARA_CTRL1_DEN3(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< XBARA_CTRL1.DEN3 Field                  */
#define XBARA_CTRL1_IEN3_MASK                    (0x200U)                                            /*!< XBARA_CTRL1.IEN3 Mask                   */
#define XBARA_CTRL1_IEN3_SHIFT                   (9U)                                                /*!< XBARA_CTRL1.IEN3 Position               */
#define XBARA_CTRL1_IEN3(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< XBARA_CTRL1.IEN3 Field                  */
#define XBARA_CTRL1_EDGE3_MASK                   (0xC00U)                                            /*!< XBARA_CTRL1.EDGE3 Mask                  */
#define XBARA_CTRL1_EDGE3_SHIFT                  (10U)                                               /*!< XBARA_CTRL1.EDGE3 Position              */
#define XBARA_CTRL1_EDGE3(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< XBARA_CTRL1.EDGE3 Field                 */
#define XBARA_CTRL1_STS3_MASK                    (0x1000U)                                           /*!< XBARA_CTRL1.STS3 Mask                   */
#define XBARA_CTRL1_STS3_SHIFT                   (12U)                                               /*!< XBARA_CTRL1.STS3 Position               */
#define XBARA_CTRL1_STS3(x)                      (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< XBARA_CTRL1.STS3 Field                  */
/**
 * @} */ /* End group XBARA_Register_Masks_GROUP 
 */

